AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/УровеньДоступаКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УровеньДоступаКлиента</Name>
			<Comment>Иерархия: Всем &lt; Постоянный &lt; VIP2 &lt; VIP1. Используется и для категории контрагента, и для минимальной видимости номенклатуры.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Всем</Name>
					<Comment>Розница + опт вне групп (базовый/нулевой уровень)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Постоянный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VIP2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VIP1</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/КатегоризацияКлиентов/Ext/Module.bsl
// Расчёт УровеньДоступа контрагентов (Всем/Постоянный/VIP2/VIP1) по продажам за период.
//
// Метрики считаются не по отдельному контрагенту, а по ГоловномуКонтрагенту — суммируются
// продажи всех точек одного головного, чтобы крупный клиент с несколькими точками не размазался
// на несколько "средних" вместо одного крупного.
//
//  Оборот        - сумма продаж головного контрагента за период, ЕДИНСТВЕННЫЙ критерий уровня
//  КоличествоТоваров - сколько единиц товара куплено за период (справочно, на уровень не влияет)
//  Широта        - доля номенклатуры (из проданной за период всем клиентам), которую купил клиент
//  Стабильность  - доля месяцев периода, в которые у клиента были продажи
//
// Итоговый уровень — по процентильным порогам от оборота (20% / 30% / 50% всех клиентов).
// Раньше здесь была составная оценка (оборот, скорректированный на широту и стабильность) плюс
// принудительное понижение "клиентов за сливками" по концентрации на хитах - от этого отказались
// в пользу простого и понятного клиенту правила: чем больше купил в деньгах, тем выше уровень.
// Широта/Стабильность/Концентрация в расчёте уровня больше не участвуют.

// Строковый код уровня доступа для внешних систем (сайт/приложение) - не зависит от синонима
// перечисления, который может меняться в интерфейсе Конфигуратора. Пусто (ещё не посчитано
// регламентным заданием) трактуется как "Всем". Используется и выгрузкой покупателей
// (DataProcessors.ОбменПокупателямиНашСайт), и выгрузкой номенклатуры (DataProcessors.ВыгрузкаНашСайт).
//
Функция КодУровня(Значение) Экспорт

	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "Всем";
	ИначеЕсли Значение = Перечисления.УровеньДоступаКлиента.VIP1 Тогда
		Возврат "VIP1";
	ИначеЕсли Значение = Перечисления.УровеньДоступаКлиента.VIP2 Тогда
		Возврат "VIP2";
	ИначеЕсли Значение = Перечисления.УровеньДоступаКлиента.Постоянный Тогда
		Возврат "Постоянный";
	Иначе
		Возврат "Всем";
	КонецЕсли;

КонецФункции

// Считает количество отдельных календарных месяцев в периоде [ДатаНачала; ДатаОкончания].
//
Функция ЧислоМесяцевПериода(ДатаНачала, ДатаОкончания) Экспорт

	Если ДатаОкончания < ДатаНачала Тогда
		Возврат 0;
	КонецЕсли;

	Возврат (Год(ДатаОкончания) - Год(ДатаНачала)) * 12 + (Месяц(ДатаОкончания) - Месяц(ДатаНачала)) + 1;

КонецФункции

// Группы контрагентов, которые считаются оптовыми клиентами сайта: Соответствие(СсылкаГруппы -> Код).
//
// Единый источник правды для двух мест, которые ОБЯЗАНЫ работать по одной популяции: расстановки
// уровней доступа и выгрузки покупателей на сайт. Пока категоризация считала проценты по всем
// контрагентам подряд, а выгрузка отбирала только эти группы, границы уровней брались не от той
// базы: в рейтинг попадали разовые розничные покупки физлиц, и VIP1 доставался клиенту с оборотом
// 35 тысяч за два года наравне с партнёром на три с половиной миллиона.
//
Функция ГруппыОптовыхКлиентов() Экспорт

	КодыГрупп = Новый Массив;
	КодыГрупп.Добавить("000000231");
	КодыГрупп.Добавить("000000463");
	КодыГрупп.Добавить("000001993");
	КодыГрупп.Добавить("000005514");
	КодыГрупп.Добавить("000005552");

	Результат = Новый Соответствие;

	Для Каждого Код Из КодыГрупп Цикл
		Группа = Справочники.Контрагенты.НайтиПоКоду(Код);
		Если ЗначениеЗаполнено(Группа) Тогда
			Результат.Вставить(Группа, Код);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Массив ссылок на группы оптовых клиентов - для условия В ИЕРАРХИИ в запросах.
//
Функция МассивГруппОптовыхКлиентов() Экспорт

	Результат = Новый Массив;

	Для Каждого Элемент Из ГруппыОптовыхКлиентов() Цикл
		Результат.Добавить(Элемент.Ключ);
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Период, за который считаются уровни доступа - два ПОЛНЫХ прошлых календарных года (при запуске
// в 2026 году это 01.01.2024 - 31.12.2025). Текущий незавершённый год сознательно не берём: иначе
// уровень клиента скакал бы в течение года по мере накопления продаж, а в январе считался бы
// вообще по паре недель.
//
// Вынесено в отдельную функцию, потому что этот же период нужен выгрузке покупателей на сайт:
// она пересчитывает оборот и остаток до следующего уровня для личного кабинета, и цифры обязаны
// совпадать с тем уровнем, который записало регламентное задание. Период не зависит от текущей
// даты внутри года, поэтому обе стороны всегда получают одинаковые границы.
//
Функция ПериодКатегоризации() Экспорт

	ТекущийГод = Год(ТекущаяДатаСеанса());

	Возврат Новый Структура("ДатаНачала, ДатаОкончания",
		Дата(ТекущийГод - 2, 1, 1),
		КонецГода(Дата(ТекущийГод - 1, 1, 1)));

КонецФункции

// Оборот строки таблицы по её номеру (1-based). Нужен, чтобы взять оборот последнего клиента,
// попавшего в уровень - это планка входа в этот уровень. Ноль, если индекс за пределами таблицы
// (мало клиентов, граница уровня схлопнулась).
//
Функция ОборотПоИндексу(ТаблицаРезультатов, Индекс)

	Если Индекс <= 0 Или Индекс > ТаблицаРезультатов.Количество() Тогда
		Возврат 0;
	КонецЕсли;

	Возврат ТаблицаРезультатов[Индекс - 1].Оборот;

КонецФункции

// Основной расчёт. Возвращает ТаблицуЗначений с колонками:
//   ГоловнойКонтрагент, Оборот, КоличествоТоваров, Широта, Стабильность, Уровень,
//   ОборотДоСледующегоУровня
//
// Уровень определяется ТОЛЬКО оборотом в деньгах: клиенты сортируются по обороту за период
// и режутся по процентильным границам. Широта/Стабильность остаются в результате как справочные
// цифры для глазами-проверки, но на уровень не влияют.
//
// Параметры:
//  ДатаНачала, ДатаОкончания      - период анализа продаж
//  Записывать                     - Истина: пишет УровеньДоступа в контрагентов, у которых
//                                    НЕ взведён УровеньУстановленВручную. Ложь: только расчёт (предпросмотр).
//  ПроцентVIP1/VIP2/Постоянный    - какую долю оптовых клиентов (в процентах, от самого крупного
//                                    по обороту к самому мелкому) относить к каждому уровню.
//                                    По умолчанию 20/30/50 - в сумме 100%, то есть уровень "Всем"
//                                    остаётся только тем, кто не прошёл отбор ниже.
//  МинимумПозиций                 - сколько РАЗНЫХ позиций номенклатуры клиент должен был купить
//                                    за период, чтобы вообще попасть в рейтинг. Отсекает разовые
//                                    розничные покупки: по факту 57% контрагентов с продажами
//                                    покупали ровно одну позицию, и все вместе такие давали 6%
//                                    оборота - но раздували базу, от которой считались проценты.
//  МинимумОборота                 - то же самое, но по деньгам. 0 - не применять.
//  ИмяФайлаПредпросмотра          - если заполнено, результат сохраняется туда же CSV-файлом (UTF-8)
//
// Отбор клиентов: только контрагенты из групп оптовых клиентов сайта (см. ГруппыОптовыхКлиентов),
// прошедшие пороги МинимумПозиций/МинимумОборота. Все остальные в рейтинг не попадают и остаются
// на уровне "Всем" - им новинки не показываются, что для разовых покупателей и нужно.
//
Функция РассчитатьУровниДоступа(ДатаНачала, ДатаОкончания,
	Знач Записывать = Ложь,
	Знач ПроцентVIP1 = 20,
	Знач ПроцентVIP2 = 30,
	Знач ПроцентПостоянный = 50,
	Знач МинимумПозиций = 5,
	Знач МинимумОборота = 0,
	Знач ИмяФайлаПредпросмотра = "") Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));
	Запрос.УстановитьПараметр("Группы", МассивГруппОптовыхКлиентов());
	Запрос.УстановитьПараметр("МинимумПозиций", МинимумПозиций);
	Запрос.УстановитьПараметр("МинимумОборота", МинимумОборота);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиОбороты.Период          КАК Месяц,
	|	ПродажиОбороты.Контрагент      КАК Контрагент,
	|	ПродажиОбороты.Номенклатура    КАК Номенклатура,
	|	ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	|	ПродажиОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, Месяц, ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.СтоимостьОборот <> 0
	|	И ПродажиОбороты.Контрагент В ИЕРАРХИИ(&Группы)
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_Продажи.Месяц,
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Стоимость,
	|	ВТ_Продажи.Количество,
	|	ЕСТЬNULL(Контрагенты.ГоловнойКонтрагент, ВТ_Продажи.Контрагент) КАК ГоловнойКонтрагент
	|ПОМЕСТИТЬ ВТ_ПродажиПоГолове
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО ВТ_Продажи.Контрагент = Контрагенты.Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент,
	|	СУММА(ВТ_ПродажиПоГолове.Стоимость) КАК Оборот,
	|	СУММА(ВТ_ПродажиПоГолове.Количество) КАК КоличествоТоваров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПродажиПоГолове.Номенклатура) КАК КоличествоНоменклатур,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПродажиПоГолове.Месяц) КАК КоличествоМесяцев
	|ПОМЕСТИТЬ ВТ_ОборотПоГолове
	|ИЗ
	|	ВТ_ПродажиПоГолове КАК ВТ_ПродажиПоГолове
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПродажиПоГолове.Номенклатура) >= &МинимумПозиций
	|	И СУММА(ВТ_ПродажиПоГолове.Стоимость) >= &МинимумОборота
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Продажи.Номенклатура) КАК ВсегоНоменклатур
	|ПОМЕСТИТЬ ВТ_Итого
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ОборотПоГолове.ГоловнойКонтрагент,
	|	ВТ_ОборотПоГолове.Оборот,
	|	ВТ_ОборотПоГолове.КоличествоТоваров,
	|	ВТ_ОборотПоГолове.КоличествоНоменклатур,
	|	ВТ_ОборотПоГолове.КоличествоМесяцев,
	|	ВТ_Итого.ВсегоНоменклатур КАК ВсегоНоменклатур
	|ИЗ
	|	ВТ_ОборотПоГолове КАК ВТ_ОборотПоГолове,
	|	ВТ_Итого КАК ВТ_Итого";

	ВыборкаРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаЗапроса = ВыборкаРезультатов[ВыборкаРезультатов.Количество() - 1].Выгрузить();

	МесяцевВПериоде = ЧислоМесяцевПериода(ДатаНачала, ДатаОкончания);

	ТаблицаРезультатов = Новый ТаблицаЗначений;
	ТаблицаРезультатов.Колонки.Добавить("ГоловнойКонтрагент");
	ТаблицаРезультатов.Колонки.Добавить("Оборот");
	ТаблицаРезультатов.Колонки.Добавить("КоличествоТоваров");
	ТаблицаРезультатов.Колонки.Добавить("Широта");
	ТаблицаРезультатов.Колонки.Добавить("Стабильность");
	ТаблицаРезультатов.Колонки.Добавить("Уровень");
	ТаблицаРезультатов.Колонки.Добавить("ОборотДоСледующегоУровня");

	Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл

		НоваяСтрока = ТаблицаРезультатов.Добавить();
		НоваяСтрока.ГоловнойКонтрагент = СтрокаЗапроса.ГоловнойКонтрагент;
		НоваяСтрока.Оборот = СтрокаЗапроса.Оборот;
		НоваяСтрока.КоличествоТоваров = СтрокаЗапроса.КоличествоТоваров;

		// Широта и Стабильность больше НЕ участвуют в расстановке уровней (уровень определяется
		// только оборотом), но остаются в таблице как справочные - по ним удобно глазами оценить
		// клиента в файле предпросмотра.
		НоваяСтрока.Широта = ?(СтрокаЗапроса.ВсегоНоменклатур = 0, 0,
			СтрокаЗапроса.КоличествоНоменклатур / СтрокаЗапроса.ВсегоНоменклатур);
		НоваяСтрока.Стабильность = ?(МесяцевВПериоде = 0, 0,
			Мин(1, СтрокаЗапроса.КоличествоМесяцев / МесяцевВПериоде));

	КонецЦикла;

	ТаблицаРезультатов.Сортировать("Оборот Убыв");

	Всего = ТаблицаРезультатов.Количество();
	ГраницаVIP1 = Окр(Всего * ПроцентVIP1 / 100, 0);
	ГраницаVIP2 = Окр(Всего * (ПроцентVIP1 + ПроцентVIP2) / 100, 0);
	ГраницаПостоянный = Окр(Всего * (ПроцентVIP1 + ПроцентVIP2 + ПроцентПостоянный) / 100, 0);

	// Оборот последнего клиента, попавшего в уровень - это и есть планка, которую нужно перешагнуть
	// снизу, чтобы туда войти. Из неё считается "сколько осталось до следующего уровня" для кабинета.
	ОборотПланкиVIP1        = ОборотПоИндексу(ТаблицаРезультатов, ГраницаVIP1);
	ОборотПланкиVIP2        = ОборотПоИндексу(ТаблицаРезультатов, ГраницаVIP2);
	ОборотПланкиПостоянный  = ОборотПоИндексу(ТаблицаРезультатов, ГраницаПостоянный);

	Индекс = 0;
	Для Каждого Стр Из ТаблицаРезультатов Цикл

		Индекс = Индекс + 1;

		Если Индекс <= ГраницаVIP1 Тогда
			Стр.Уровень = Перечисления.УровеньДоступаКлиента.VIP1;
			Стр.ОборотДоСледующегоУровня = 0;
		ИначеЕсли Индекс <= ГраницаVIP2 Тогда
			Стр.Уровень = Перечисления.УровеньДоступаКлиента.VIP2;
			Стр.ОборотДоСледующегоУровня = Макс(0, ОборотПланкиVIP1 - Стр.Оборот);
		ИначеЕсли Индекс <= ГраницаПостоянный Тогда
			Стр.Уровень = Перечисления.УровеньДоступаКлиента.Постоянный;
			Стр.ОборотДоСледующегоУровня = Макс(0, ОборотПланкиVIP2 - Стр.Оборот);
		Иначе
			Стр.Уровень = Перечисления.УровеньДоступаКлиента.Всем;
			Стр.ОборотДоСледующегоУровня = Макс(0, ОборотПланкиПостоянный - Стр.Оборот);
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеЗаполнено(ИмяФайлаПредпросмотра) Тогда
		ЗаписатьРезультатВФайл(ТаблицаРезультатов, ИмяФайлаПредпросмотра);
	КонецЕсли;

	Если Записывать Тогда
		ЗаписатьУровниДоступа(ТаблицаРезультатов);
	КонецЕсли;

	Возврат ТаблицаРезультатов;

КонецФункции

// Пишет УровеньДоступа всем оптовым контрагентам, кроме тех, у кого взведён УровеньУстановленВручную.
//
// Проходим НЕ по таблице результатов, а по всем контрагентам оптовых групп. Тем, чей головной есть
// в рейтинге, ставим рассчитанный уровень; всем остальным - "Всем". Это обязательно: клиент мог
// выпасть из рейтинга (не прошёл МинимумПозиций, перестал покупать, ушёл из оптовой группы), и если
// пройтись только по таблице результатов, у него навсегда останется старый уровень. Именно так
// разовый покупатель на 2970 грн с одной позицией продолжал числиться VIP2 и видеть новинки.
//
Процедура ЗаписатьУровниДоступа(ТаблицаРезультатов) Экспорт

	УровниПоГоловам = Новый Соответствие;
	Для Каждого Стр Из ТаблицаРезультатов Цикл
		УровниПоГоловам.Вставить(Стр.ГоловнойКонтрагент, Стр.Уровень);
	КонецЦикла;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Ссылка,
	|	Контрагенты.ГоловнойКонтрагент КАК ГоловнойКонтрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка В ИЕРАРХИИ(&Группы)
	|	И НЕ Контрагенты.ЭтоГруппа
	|	И НЕ Контрагенты.УровеньУстановленВручную");
	Запрос.УстановитьПараметр("Группы", МассивГруппОптовыхКлиентов());

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		// Головным считается сам контрагент, если реквизит не заполнен - так же, как при агрегации
		// продаж в РассчитатьУровниДоступа.
		Голова = ?(ЗначениеЗаполнено(Выборка.ГоловнойКонтрагент), Выборка.ГоловнойКонтрагент, Выборка.Ссылка);

		НовыйУровень = УровниПоГоловам[Голова];
		Если НовыйУровень = Неопределено Тогда
			НовыйУровень = Перечисления.УровеньДоступаКлиента.Всем;
		КонецЕсли;

		КонтрагентОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если КонтрагентОбъект <> Неопределено И КонтрагентОбъект.УровеньДоступа <> НовыйУровень Тогда
			КонтрагентОбъект.УровеньДоступа = НовыйУровень;
			КонтрагентОбъект.Записать();
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

// Сохраняет таблицу результатов CSV-файлом (UTF-8) для ручной сверки перед включением
// регламентного задания на постоянку.
//
Процедура ЗаписатьРезультатВФайл(ТаблицаРезультатов, ИмяФайла) Экспорт

	Запись = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	Запись.ЗаписатьСтроку(
		"ГоловнойКонтрагент;Оборот;КоличествоТоваров;Широта;Стабильность;Уровень;ДоСледующегоУровня");

	Для Каждого Стр Из ТаблицаРезультатов Цикл
		Запись.ЗаписатьСтроку(
			СокрЛП(Стр.ГоловнойКонтрагент) + ";"
			+ Формат(Стр.Оборот, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0") + ";"
			+ Формат(Стр.КоличествоТоваров, "ЧЦ=15; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
			+ Формат(Стр.Широта, "ЧЦ=5; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
			+ Формат(Стр.Стабильность, "ЧЦ=5; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
			+ СокрЛП(Стр.Уровень) + ";"
			+ Формат(Стр.ОборотДоСледующегоУровня, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0"));
	КонецЦикла;

	Запись.Закрыть();

КонецПроцедуры

// Точка входа регламентного задания. Период - два ПОЛНЫХ прошлых календарных года (то есть при
// запуске в 2026 году это 01.01.2024 - 31.12.2025), текущий незавершённый год сознательно не берём:
// иначе уровень клиента скакал бы в течение года по мере накопления продаж, а в начале года
// считался бы вообще по паре месяцев. Полные годы дают устойчивую базу сравнения и ровно два
// одинаковых сезонных цикла на каждого клиента.
// Записывает результат в базу (Записывать = Истина) и оставляет след в журнале регистрации.
//
Процедура ВыполнитьРегламентноеЗадание() Экспорт

	Период = ПериодКатегоризации();

	ТаблицаРезультатов = РассчитатьУровниДоступа(Период.ДатаНачала, Период.ДатаОкончания, Истина);

	РаспределениеПоУровням = Новый Соответствие;
	Для Каждого Стр Из ТаблицаРезультатов Цикл
		Ключ = СокрЛП(Стр.Уровень);
		Если РаспределениеПоУровням[Ключ] = Неопределено Тогда
			РаспределениеПоУровням.Вставить(Ключ, 1);
		Иначе
			РаспределениеПоУровням.Вставить(Ключ, РаспределениеПоУровням[Ключ] + 1);
		КонецЕсли;
	КонецЦикла;

	СтрокаРаспределения = "";
	Для Каждого Элемент Из РаспределениеПоУровням Цикл
		СтрокаРаспределения = СтрокаРаспределения + Элемент.Ключ + "=" + Элемент.Значение + "; ";
	КонецЦикла;

	ЗаписьЖурналаРегистрации("Категоризация клиентов",
		УровеньЖурналаРегистрации.Информация,
		,
		,
		"Обработано головных контрагентов: " + ТаблицаРезультатов.Количество() + ". "
		+ "Распределение по уровням: " + СтрокаРаспределения);

КонецПроцедуры

// ДИАГНОСТИКА (разовый прогон, в базу НИЧЕГО не пишет). Отвечает на вопрос "кто из клиентов
// снимает сливки" - то есть берёт почти только ходовые позиции, не трогая остальной ассортимент.
//
// Ключевая колонка - КонцентрацияНаХитах: доля оборота клиента, пришедшаяся на топ-N позиций
// компании за период. Она НЕ зависит от размера клиента: маленький сельский магазин, взявший
// тридцать позиций вразброс, покажет невысокую концентрацию, а взявший пять хитов на ту же сумму -
// высокую. Именно этим она отличается от ДоляАссортимента (сколько процентов всей проданной
// компанией номенклатуры клиент вообще трогал) - вот та как раз меряет в первую очередь размер:
// у магазина с маленькой полкой она физически не может быть большой, сколько его ни стимулируй.
// Обе колонки выведены рядом специально, чтобы это различие было видно глазами.
//
// Параметры:
//  ДатаНачала, ДатаОкончания - период анализа
//  КоличествоХитов           - сколько топовых по обороту позиций компании считать "хитами"
//  ИмяФайла                  - если заполнено, результат пишется туда CSV-файлом (UTF-8)
//
// Пример запуска:
//  КатегоризацияКлиентов.ДиагностикаКонцентрацииНаХитах('20240101','20251231', 50, "C:\temp\concentration.csv")
//
Функция ДиагностикаКонцентрацииНаХитах(ДатаНачала, ДатаОкончания,
	Знач КоличествоХитов = 50,
	Знач ИмяФайла = "") Экспорт

	// "ВЫБРАТЬ ПЕРВЫЕ N" принимает только целочисленный литерал, параметр запроса здесь недопустим.
	КоличествоХитовЛитерал = Формат(Цел(КоличествоХитов), "ЧГ=0; ЧДЦ=0");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));

	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажиОбороты.Контрагент       КАК Контрагент,
	|	ПродажиОбороты.Номенклатура     КАК Номенклатура,
	|	ПродажиОбороты.СтоимостьОборот  КАК Стоимость,
	|	ПродажиОбороты.КоличествоОборот КАК Количество
	|ПОМЕСТИТЬ ВТ_Продажи
	|ИЗ
	|	РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты
	|ГДЕ
	|	ПродажиОбороты.СтоимостьОборот <> 0
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_Продажи.Номенклатура,
	|	ВТ_Продажи.Стоимость,
	|	ВТ_Продажи.Количество,
	|	ЕСТЬNULL(Контрагенты.ГоловнойКонтрагент, ВТ_Продажи.Контрагент) КАК ГоловнойКонтрагент
	|ПОМЕСТИТЬ ВТ_ПродажиПоГолове
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|	ПО ВТ_Продажи.Контрагент = Контрагенты.Ссылка
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент,
	|	СУММА(ВТ_ПродажиПоГолове.Стоимость) КАК Оборот,
	|	СУММА(ВТ_ПродажиПоГолове.Количество) КАК КоличествоТоваров,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ПродажиПоГолове.Номенклатура) КАК ПозицийКуплено
	|ПОМЕСТИТЬ ВТ_ОборотПоГолове
	|ИЗ
	|	ВТ_ПродажиПоГолове КАК ВТ_ПродажиПоГолове
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ " + КоличествоХитовЛитерал + "
	|	ВТ_Продажи.Номенклатура КАК Номенклатура,
	|	СУММА(ВТ_Продажи.Стоимость) КАК ОборотПозиции
	|ПОМЕСТИТЬ ВТ_Хиты
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Продажи.Номенклатура
	|УПОРЯДОЧИТЬ ПО
	|	ОборотПозиции УБЫВ
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент,
	|	СУММА(ВТ_ПродажиПоГолове.Стоимость) КАК ОборотПоХитам
	|ПОМЕСТИТЬ ВТ_ОборотПоХитам
	|ИЗ
	|	ВТ_ПродажиПоГолове КАК ВТ_ПродажиПоГолове
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Хиты КАК ВТ_Хиты
	|	ПО ВТ_ПродажиПоГолове.Номенклатура = ВТ_Хиты.Номенклатура
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПродажиПоГолове.ГоловнойКонтрагент
	|;
	|
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_Продажи.Номенклатура) КАК ВсегоПозиций
	|ПОМЕСТИТЬ ВТ_Итого
	|ИЗ
	|	ВТ_Продажи КАК ВТ_Продажи
	|;
	|
	|ВЫБРАТЬ
	|	ВТ_ОборотПоГолове.ГоловнойКонтрагент КАК ГоловнойКонтрагент,
	|	ВТ_ОборотПоГолове.Оборот КАК Оборот,
	|	ВТ_ОборотПоГолове.КоличествоТоваров КАК КоличествоТоваров,
	|	ВТ_ОборотПоГолове.ПозицийКуплено КАК ПозицийКуплено,
	|	ЕСТЬNULL(ВТ_ОборотПоХитам.ОборотПоХитам, 0) КАК ОборотПоХитам,
	|	ВТ_Итого.ВсегоПозиций КАК ВсегоПозиций
	|ИЗ
	|	ВТ_ОборотПоГолове КАК ВТ_ОборотПоГолове
	|	ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОборотПоХитам КАК ВТ_ОборотПоХитам
	|	ПО ВТ_ОборотПоГолове.ГоловнойКонтрагент = ВТ_ОборотПоХитам.ГоловнойКонтрагент,
	|	ВТ_Итого КАК ВТ_Итого";

	ВыборкаРезультатов = Запрос.ВыполнитьПакет();
	ТаблицаЗапроса = ВыборкаРезультатов[ВыборкаРезультатов.Количество() - 1].Выгрузить();

	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("ГоловнойКонтрагент");
	Результат.Колонки.Добавить("Оборот");
	Результат.Колонки.Добавить("КоличествоТоваров");
	Результат.Колонки.Добавить("ПозицийКуплено");
	Результат.Колонки.Добавить("ДоляАссортимента");
	Результат.Колонки.Добавить("ОборотПоХитам");
	Результат.Колонки.Добавить("КонцентрацияНаХитах");
	Результат.Колонки.Добавить("Уровень");

	Для Каждого СтрокаЗапроса Из ТаблицаЗапроса Цикл

		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.ГоловнойКонтрагент = СтрокаЗапроса.ГоловнойКонтрагент;
		НоваяСтрока.Оборот = СтрокаЗапроса.Оборот;
		НоваяСтрока.КоличествоТоваров = СтрокаЗапроса.КоличествоТоваров;
		НоваяСтрока.ПозицийКуплено = СтрокаЗапроса.ПозицийКуплено;
		НоваяСтрока.ОборотПоХитам = СтрокаЗапроса.ОборотПоХитам;

		НоваяСтрока.ДоляАссортимента = ?(СтрокаЗапроса.ВсегоПозиций = 0, 0,
			СтрокаЗапроса.ПозицийКуплено / СтрокаЗапроса.ВсегоПозиций);
		НоваяСтрока.КонцентрацияНаХитах = ?(СтрокаЗапроса.Оборот = 0, 0,
			СтрокаЗапроса.ОборотПоХитам / СтрокаЗапроса.Оборот);

		НоваяСтрока.Уровень = КодУровня(СтрокаЗапроса.ГоловнойКонтрагент.УровеньДоступа);

	КонецЦикла;

	// Сортировка по концентрации: сверху окажутся самые явные сливкосниматели
	// (весь оборот в хитах), снизу - те, кто берёт ассортимент вразброс.
	Результат.Сортировать("КонцентрацияНаХитах Убыв");

	Если ЗначениеЗаполнено(ИмяФайла) Тогда

		Запись = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
		Запись.ЗаписатьСтроку(
			"ГоловнойКонтрагент;Оборот;КоличествоТоваров;ПозицийКуплено;ДоляАссортимента;"
			+ "ОборотПоХитам;КонцентрацияНаХитах;Уровень");

		Для Каждого Стр Из Результат Цикл
			Запись.ЗаписатьСтроку(
				СокрЛП(Стр.ГоловнойКонтрагент) + ";"
				+ Формат(Стр.Оборот, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0") + ";"
				+ Формат(Стр.КоличествоТоваров, "ЧЦ=15; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
				+ Формат(Стр.ПозицийКуплено, "ЧЦ=15; ЧДЦ=0; ЧГ=0; ЧН=0") + ";"
				+ Формат(Стр.ДоляАссортимента, "ЧЦ=5; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
				+ Формат(Стр.ОборотПоХитам, "ЧЦ=15; ЧДЦ=2; ЧГ=0; ЧН=0") + ";"
				+ Формат(Стр.КонцентрацияНаХитах, "ЧЦ=5; ЧДЦ=3; ЧГ=0; ЧН=0") + ";"
				+ СокрЛП(Стр.Уровень));
		КонецЦикла;

		Запись.Закрыть();

	КонецЕсли;

	Возврат Результат;

КонецФункции

// ДИАГНОСТИКА (временная, для разового запуска через отладчик). Возвращает текстовый список
// "Код | Наименование" всех свойств (РегистрСведений.ЗначенияСвойствОбъектов.Свойство), реально
// назначенных на номенклатуру, которая продавалась за период - чтобы найти точные коды свойств
// "Пол"/"Сезон" (по аналогии с уже известным кодом 000000037 у "Тип виробу"), раз поиск по имени
// не сработал (ДатаНачала/ДатаОкончания разумно взять пошире, например весь прошлый год).
//
Функция ДиагностикаСвойствНоменклатуры(ДатаНачала, ДатаОкончания) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ДатаНачала));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ДатаОкончания));

	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код         КАК Код,
	|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ПродажиОбороты.Номенклатура
	|		 ИЗ
	|			РегистрНакопления.Продажи.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ПродажиОбороты)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование";

	Результат = "";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат = Результат + Выборка.Код + " | " + Выборка.Наименование + Символы.ПС;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// ДИАГНОСТИКА (временная): все РАЗЛИЧНЫЕ значения конкретного свойства (по коду), как они
// реально записаны в РегистрСведений.ЗначенияСвойствОбъектов, с точным представлением
// (в кавычках, чтобы были видны лишние пробелы) и количеством номенклатур на каждое значение.
//
Функция ДиагностикаЗначенийСвойства(КодСвойства) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодСвойства", КодСвойства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Значение КАК Значение,
	|	ЗначенияСвойствОбъектов.Объект   КАК Объект
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код = &КодСвойства";

	Счётчики = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Представление = Строка(Выборка.Значение);
		Если Счётчики[Представление] = Неопределено Тогда
			Счётчики.Вставить(Представление, 1);
		Иначе
			Счётчики.Вставить(Представление, Счётчики[Представление] + 1);
		КонецЕсли;
	КонецЦикла;

	Результат = "";
	Для Каждого Элемент Из Счётчики Цикл
		Результат = Результат + """" + Элемент.Ключ + """ - " + Элемент.Значение + Символы.ПС;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// СЛИЯНИЕ ДУБЛЕЙ ЗНАЧЕНИЯ СВОЙСТВА (временная, для разового исправления, например "Куртки" /
// "Куртки и пальто" в свойстве "Тип виробу"). Находит оба значения свойства КодСвойства по их
// названиям (сравнение по Строка(Значение), без учёта регистра пробелов по краям) и, при
// Записывать=Истина, перепривязывает ВСЕ записи РегистрСведений.ЗначенияСвойствОбъектов
// с дублирующим значением на каноническое. Сам элемент-дубль в справочнике значений НЕ удаляется
// и не переименовывается - это отдельное ручное действие после проверки результата.
//
// Записывать=Ложь (по умолчанию) - только считает и возвращает сводку, ничего не меняет.
//
Функция ОбъединитьЗначенияСвойства(КодСвойства, ИмяКанонического, ИмяДубля, Знач Записывать = Ложь) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КодСвойства", КодСвойства);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	|	ЗначенияСвойствОбъектов.Значение КАК Значение,
	|	ЗначенияСвойствОбъектов.Объект   КАК Объект
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Свойство.Код = &КодСвойства";

	ЗначениеКанонического = Неопределено;
	ЗначениеДубля = Неопределено;
	СтрокиДубля = Новый Массив;

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

		Представление = СокрЛП(Строка(Выборка.Значение));

		Если Представление = СокрЛП(ИмяКанонического) Тогда
			ЗначениеКанонического = Выборка.Значение;
		ИначеЕсли Представление = СокрЛП(ИмяДубля) Тогда
			ЗначениеДубля = Выборка.Значение;
			СтрокиДубля.Добавить(Новый Структура("Свойство, Объект", Выборка.Свойство, Выборка.Объект));
		КонецЕсли;

	КонецЦикла;

	Если ЗначениеКанонического = Неопределено Тогда
		Возврат "Не найдено значение """ + ИмяКанонического + """ для свойства с кодом " + КодСвойства;
	КонецЕсли;

	Если ЗначениеДубля = Неопределено Тогда
		Возврат "Не найдено значение """ + ИмяДубля + """ для свойства с кодом " + КодСвойства
			+ " (возможно, уже объединено раньше)";
	КонецЕсли;

	Результат = "Каноническое значение: " + ЗначениеКанонического + " (""" + ИмяКанонического + """)" + Символы.ПС;
	Результат = Результат + "Дублирующее значение: " + ЗначениеДубля + " (""" + ИмяДубля + """)" + Символы.ПС;
	Результат = Результат + "Затронуто номенклатур: " + СтрокиДубля.Количество() + Символы.ПС;

	Если Записывать Тогда

		Для Каждого Стр Из СтрокиДубля Цикл

			МенеджерЗаписи = РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Объект = Стр.Объект;
			МенеджерЗаписи.Свойство = Стр.Свойство;
			МенеджерЗаписи.Прочитать();

			Если МенеджерЗаписи.Выбран() Тогда
				МенеджерЗаписи.Значение = ЗначениеКанонического;
				МенеджерЗаписи.Записать();
			КонецЕсли;

		КонецЦикла;

		Результат = Результат + "Записано - все перепривязаны на каноническое значение.";

	Иначе

		Результат = Результат + "Записывать=Ложь - ничего не изменено, это предпросмотр.";

	КонецЕсли;

	Возврат Результат;

КонецФункции
